#+TITLE: Docker
#+EMAIL: @pvavilin
#+AUTHOR: @pvavilin
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:https://orgmode.org/org-info.js
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [smallest]
#+LATEX_HEADER: \usetheme{default}
#+LATEX_HEADER: \usecolortheme{crane}
#+LATEX_HEADER: \RequirePackage{fancyvrb}
#+LATEX_HEADER: \DefineVerbatimEnvironment{verbatim}{Verbatim}{fontsize=\scriptsize}
#+LaTeX_HEADER: \lstset{basicstyle=\scriptsize\ttfamily}
#+LATEX_HEADER: \usepackage{xlop}
#+LATEX_HEADER: \usepackage{booktabs}
#+OPTIONS: \n:t ^:nil num:nil ltoc:nil buttons:nil
* chroot
  Запустим Python в chroot
  #+BEGIN_SRC shell :exports both :results output vector
    echo -e "$(ldd /usr/bin/python3 | \
         egrep -o '/lib.*\.[0-9]')"
  #+END_SRC

  #+RESULTS:
  : /lib/x86_64-linux-gnu/libc.so.6
  : /lib/x86_64-linux-gnu/libpthread.so.0
  : /lib/x86_64-linux-gnu/libdl.so.2
  : /lib/x86_64-linux-gnu/libutil.so.1
  : /lib/x86_64-linux-gnu/libm.so.6
  : /lib/x86_64-linux-gnu/libexpat.so.1
  : /lib/x86_64-linux-gnu/libz.so.1
  : /lib64/ld-linux-x86-64.so.2
* Где всё на самом деле хранится?
  #+BEGIN_EXAMPLE
  /var/lib/docker
  #+END_EXAMPLE

  #+BEGIN_SRC shell :exports both :results output list
    docker system df
  #+END_SRC

  #+RESULTS:
  : - TYPE            TOTAL     ACTIVE    SIZE      RECLAIMABLE
  : - Images          0         0         0B        0B
  : - Containers      0         0         0B        0B
  : - Local Volumes   0         0         0B        0B
  : - Build Cache     0         0         0B        0B

